# DF Operations

## Filter

This is handy to extract data.

Think like SQL WHERE clause

### Filter-1 : Start with some simple data

In [1]:
import pandas as pd
import numpy as np

data_location = '../data/rainfall.csv'
# data_location = 'https://raw.githubusercontent.com/elephantscale/datasets/master/rainfall/rainfall.csv'


rain = pd.read_csv (data_location)
rain

             City Month  Rainfall
0   San Francisco   Jan      10.0
1         Seattle   Jan      30.0
2     Los Angeles   Jan       2.0
3         Seattle   Feb      20.0
4   San Francisco   Feb       4.0
5     Los Angeles   Feb       0.0
6         Seattle   Mar      22.0
7   San Francisco   Mar       4.0
8     Los Angeles   Mar       NaN
9         Seattle   Apr       NaN
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

In [2]:
# What type are the columns
rain.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      12 non-null     object
 1   Month     12 non-null     object
 2   Rainfall  10 non-null     float64
dtypes: float64(1), object(2)
memory usage: 416.0+ bytes

In [3]:
## Only extract rows, when Rainfaill is >= 10

## We are going to build this step by step

## Step -1 : What is the return of this expression

rain['Rainfall'] >= 10

0      True
1      True
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
Name: Rainfall, dtype: bool

In [12]:
## Step-2 plug in the condition to extract data

## Both will work, try them out
rain[rain['Rainfall'] >= 10 ]

# rain.loc[rain['Rainfall'] >= 10]

            City Month  Rainfall
0  San Francisco   Jan      10.0
1        Seattle   Jan      30.0
3        Seattle   Feb      20.0
6        Seattle   Mar      22.0

<span style="color:red">
    <h3> This is very imporant technique you should master! </h3>
    </span>

In [5]:
## TODO your turn
## Only extract data for month of 'Mar'
## Build the expression, step by step

# first the condition
rain ['Month'] == '???'

In [ ]:
## TODO: Then plug the condition into indexing
rain[rain['Month'] == '???']

## Combining Conditions

Find data for month of January, that had more than 10 inches of rain

In [ ]:
# first condition
rain['Month'] == 'Jan'

In [ ]:
# second condition
rain ['Rainfall'] >= 10

In [ ]:
# combine with &
(rain ['Rainfall'] >= 10) &  (rain['Month'] == 'Jan')

In [13]:
## get data
rain [  (rain ['Rainfall'] >= 10) &  (rain['Month'] == 'Jan')  ]

            City Month  Rainfall
0  San Francisco   Jan      10.0
1        Seattle   Jan      30.0

In [ ]:
## TODO: find all readings for Los Angeles?

### Filter-2

**Load house sales data.  And count how many sales were over a million dollars?**

In [6]:
data_location = '../data/house-sales-simplified.csv'
#data_location = 'https://raw.githubusercontent.com/elephantscale/python-data-analytics/main/data/house-sales-simplified.csv'
# data_location = 'https://raw.githubusercontent.com/elephantscale/python-data-analytics/main/data/house-sales-simplified.csv'

house_sales = pd.read_csv (data_location)
house_sales

,ID,Date,SalePrice,PropertyID,PropertyType,Bedrooms,Bathrooms,SqFtTotLiving,SqFtLot,YrBuilt,ZipCode
0,1,9/16/14,280000,1000102,Multiplex,6,3.00,2400,9373,1991,98002
1,2,6/16/06,1000000,1200013,Single Family,4,3.75,3764,20156,2005,98166
2,3,1/29/07,745000,1200019,Single Family,4,1.75,2060,26036,1947,98166
3,4,2/25/08,425000,2800016,Single Family,5,3.75,3200,8618,1966,98168
4,5,3/29/13,240000,2800024,Single Family,4,1.75,1720,8620,1948,98168
...,...,...,...,...,...,...,...,...,...,...,...
27058,27059,10/31/12,374000,9895000030,Townhouse,2,1.75,1410,1161,2011,-1
27059,27060,12/7/12,374000,9895000040,Townhouse,2,1.75,1410,1005,2011,-1
27060,27061,7/9/12,165000,9899200010,Single Family,4,1.00,1070,11170,1971,98055
27061,27062,5/26/06,315000,9900000355,Single Family,3,2.00,1345,6223,1939,98166
27062,27063,1/9/07,465000,9906000035,Single Family,3,1.50,790,4400,1928,98103

In [ ]:
## TODO: fill the price for million dollars
## hint: 1000000
house_sales['SalePrice'] > ????

In [ ]:
# We want the number of sales over a million dollars

## why does this code work? :-) 
sum(house_sales['SalePrice'] > ????)

In [ ]:
# TODO: to see the records over a million dollars
## Paste the expression here!
house_sales [????]

### Find out how many homes have over 10 Bedrooms!  (what!!!)

In [10]:
## TODO: your turn
# code here

In [ ]:
## Step 1 - extrat column
house_sales['Bedrooms']

In [ ]:
## Step-2 set the condition
house_sales['Bedrooms'] >= ???

In [ ]:
## Step 3 filter

house_sales [ paste_your_condition_here ]

## What about combined bedrooms + bathrooms >= 10

In [ ]:
# Step 1 - extract columns
house_sales['Bedrooms']

In [ ]:
house_sales['Bathrooms']

In [ ]:
# Step 2 - add them up
house_sales['Bedrooms'] + house_sales['Bathrooms']

In [ ]:
## step 3 - condition

house_sales['Bedrooms'] + house_sales['Bathrooms'] >= ???

In [ ]:
## step 4 extract data

house_sales [  paste_the_above_expression_here  ]

## Find Bedrooms > 10  and Bathrooms > 5

In [ ]:
# Step 1 - condition 1

house_sales['Bedrooms'] > ???

In [ ]:
## Step 2 - condition 2

house_sales['Bathrooms'] > ???

In [ ]:
## Step 3 - combine two conditions
## Notice &

( house_sales['Bedrooms'] > ??? ) &   ( house_sales['Bathrooms'] > ??? )

In [ ]:
## Step 4 - extract data

house_sales [  paste_the_expression_here ]